In [290]:
import numpy as np
import pandas as pd

In [291]:
df=pd.read_csv("quikr_car.csv")

In [292]:
df

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel
...,...,...,...,...,...,...
887,Ta,Tara,zest,"3,10,000",NaN,NaN
888,Tata Zest XM Diesel,Tata,2018,"2,60,000","27,000 kms",Diesel
889,Mahindra Quanto C8,Mahindra,2013,"3,90,000","40,000 kms",Diesel
890,Honda Amaze 1.2 E i VTEC,Honda,2014,"1,80,000",Petrol,NaN
891,Chevrolet Sail 1.2 LT ABS,Chevrolet,2014,"1,60,000",Petrol,NaN

In [293]:
df.shape

(892, 6)

In [294]:
df.size

5352

In [295]:
df.sample(30)

,name,company,year,Price,kms_driven,fuel_type
410,Honda Jazz S MT,Honda,2009,"1,69,999","24,695 kms",Petrol
444,Hyundai Verna 1.6 EX VTVT,Hyundai,2017,"8,00,000","12,000 kms",Petrol
860,Toyota Etios G,Toyota,2013,"2,65,000","42,000 kms",Petrol
605,Maruti Suzuki Alto K10 New,Maruti,2017,"3,60,000","9,400 kms",Petrol
723,I want to sell my commercial car due t,I,o...,"4,75,000",NaN,NaN
260,Ford Figo Diesel EXI,Ford,2014,"1,95,000","50,000 kms",Diesel
274,Maruti Suzuki Dzire ZXI,Maruti,2013,"3,80,000","30,000 kms",Petrol
156,Maruti Suzuki Alto 800 Lxi,Maruti,2018,"3,10,000","3,000 kms",Petrol
337,Hyundai Verna Fluidic 1.6 VTVT SX,Hyundai,2013,"4,01,000","45,000 kms",Diesel
428,Maruti Suzuki Alto 800 Vxi,Maruti,2015,"2,30,000","5,000 kms",Petrol
853,Chevrolet Sail 1.2 LS,Chevrolet,2013,"3,00,000","28,000 kms",Petrol
212,Hyundai Grand i10 Sportz O 1.2 Kappa VTVT,Hyundai,2014,"3,65,000","20,000 kms",Petrol
549,Chevrolet Beat PS Diesel,Chevrolet,2012,"2,15,000","65,422 kms",Diesel
874,Hyundai Elite i20,Hyundai,2018,"5,10,000","2,100 kms",Petrol
413,Mahindra Scorpio W Turbo 2.6DX 9 Seater,Mahindra,2012,"1,65,000","65,000 kms",Diesel
535,Hyundai Verna Fluidic New,Hyundai,2012,"3,50,000","10,000 kms",Diesel
453,Mahindra Logan Diesel 1.5 DLS,Mahindra,2009,"1,30,000","66,000 kms",Petrol
868,Tata Indigo eCS LX CR4 BS IV,Tata,2016,"1,60,000","1,04,000 kms",Diesel
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
750,Maruti Suzuki Alto 800 Lxi,Maruti,2015,"2,15,000","50,000 kms",Petrol
738,Hyundai Creta 1.6 SX,Hyundai,2019,"12,00,000",0 kms,Petrol
230,Audi A4 1.8 TFSI Multitronic Premium Plus,Audi,2009,"6,99,000","47,000 kms",Petrol
504,Maruti Suzuki Zen LXi BSII,Maruti,2003,"99,999","53,000 kms",Petrol
560,Hyun,Hyundai,Eon,Ask For Price,NaN,NaN
333,Hyundai Elite i20,Hyundai,2016,"5,49,999","9,000 kms",Petrol
94,BMW 3 Series 320i,BMW,2011,"6,00,000","60,500 kms",Petrol
367,Tata Indigo eCS VX CR4 BS IV,Tata,2014,"2,50,000","40,000 kms",Diesel
471,Tata Indigo CS eLS BS IV,Tata,2015,"1,23,000","1,00,000 kms",Diesel
655,Maruti Suzuki Ciaz ZXi Plus RS,Maruti,2016,"6,50,000","50,000 kms",Petrol
550,Ford EcoSport Trend 1.5 Ti VCT,Ford,2017,"5,80,000","10,000 kms",Petrol

In [296]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

1. Write a summary for your data
this dataset is used to predict of usedcar price  
it contains 892  row having  name  , company ,year, Price ,kms_driven, fuel_type

This is a webscrapped data from a car resale websites, which include more details of the cars along with its respective prices.
The columns included are:

Types of Assessment
There are 2 types of assessment styles

Manual - Looking through the data manually in google sheets
Programmatic - By using pandas functions such as info(), describe() or sample()


Steps in Assessment
There are 2 steps involved in Assessment
  * Discover
  * Document

Issues with the dataset
1.Dirty Data
car->Hyundai i20 Sportz 1.2->duplicate data
year->string present ans object type
price->sting present and object type
kms_driven->contains null values and remove kms convert into int
fuel_type->contains null values

In [297]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [298]:
backup=df.copy()

In [299]:
backup

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel
...,...,...,...,...,...,...
887,Ta,Tara,zest,"3,10,000",NaN,NaN
888,Tata Zest XM Diesel,Tata,2018,"2,60,000","27,000 kms",Diesel
889,Mahindra Quanto C8,Mahindra,2013,"3,90,000","40,000 kms",Diesel
890,Honda Amaze 1.2 E i VTEC,Honda,2014,"1,80,000",Petrol,NaN
891,Chevrolet Sail 1.2 LT ABS,Chevrolet,2014,"1,60,000",Petrol,NaN

In [300]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [301]:
df['name']

0        Hyundai Santro Xing XO eRLX Euro III
1                     Mahindra Jeep CL550 MDI
2                  Maruti Suzuki Alto 800 Vxi
3      Hyundai Grand i10 Magna 1.2 Kappa VTVT
4            Ford EcoSport Titanium 1.5L TDCi
                        ...
887                                        Ta
888                       Tata Zest XM Diesel
889                        Mahindra Quanto C8
890                  Honda Amaze 1.2 E i VTEC
891                 Chevrolet Sail 1.2 LT ABS
Name: name, Length: 892, dtype: object

In [302]:
df['company']

0        Hyundai
1       Mahindra
2         Maruti
3        Hyundai
4           Ford
         ...
887         Tara
888         Tata
889     Mahindra
890        Honda
891    Chevrolet
Name: company, Length: 892, dtype: object

In [303]:
df['year'].sample(50)

686    2009
123    2011
418    2016
565    2006
578    2016
767    2014
881    2009
242    2012
777    2007
307    2013
689    2009
703    2006
28     2008
378    2015
172    2011
391    2015
239    2016
822    2019
612    2014
557    2013
262    2014
804    2013
515    2010
501    2007
521    2013
0      2007
755    2014
319    2012
650    2012
137    2006
796    n...
691    2013
500    2014
103    2015
846    2016
836    2019
561    2011
468    2008
536    2006
581    2013
713    2016
831    2012
859    2019
458    2015
577    2004
473    2015
2      2018
573    2014
304    2017
209    2009
Name: year, dtype: object

In [304]:
df=df[df['year'].str.isnumeric()]

In [305]:
df['year'].sample(5)

403    2006
197    2012
235    2014
569    2011
329    2013
Name: year, dtype: object

In [306]:
df['year']=df['year'].astype('int32')

C:\Users\vikas\AppData\Local\Temp\ipykernel_10032\1465246614.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['year']=df['year'].astype('int32')

In [307]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 842 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        842 non-null    object
 1   company     842 non-null    object
 2   year        842 non-null    int32
 3   Price       842 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: int32(1), object(5)
memory usage: 42.8+ KB

In [308]:
df['Price']

0             80,000
1           4,25,000
2      Ask For Price
3           3,25,000
4           5,75,000
           ...
886         3,00,000
888         2,60,000
889         3,90,000
890         1,80,000
891         1,60,000
Name: Price, Length: 842, dtype: object

In [309]:
df['Price'].isnull().sum()

0

In [310]:
df=df[df['Price']!="Ask For Price"]

In [311]:
df['year']

0      2007
1      2006
3      2014
4      2014
6      2012
       ...
886    2009
888    2018
889    2013
890    2014
891    2014
Name: year, Length: 819, dtype: int32

In [312]:
df['Price']

0        80,000
1      4,25,000
3      3,25,000
4      5,75,000
6      1,75,000
         ...
886    3,00,000
888    2,60,000
889    3,90,000
890    1,80,000
891    1,60,000
Name: Price, Length: 819, dtype: object

In [313]:
df['Price']=df['Price'].str.replace(',','').astype('int32')

In [314]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 819 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        819 non-null    object
 1   company     819 non-null    object
 2   year        819 non-null    int32
 3   Price       819 non-null    int32
 4   kms_driven  819 non-null    object
 5   fuel_type   816 non-null    object
dtypes: int32(2), object(4)
memory usage: 38.4+ KB

In [315]:
df.sample(20)

,name,company,year,Price,kms_driven,fuel_type
377,Hyundai i10 Magna 1.2,Hyundai,2011,175000,"45,000 kms",Petrol
672,Maruti Suzuki S Cross Sigma 1.3,Maruti,2016,615000,"21,000 kms",Diesel
346,Mahindra Xylo E4,Mahindra,2012,400000,"35,000 kms",Diesel
41,Honda City 1.5 S MT,Honda,2011,280000,"33,000 kms",Petrol
375,Maruti Suzuki Zen LXi BS III,Maruti,2003,85000,"69,900 kms",Petrol
328,Honda Amaze,Honda,2014,274999,"35,000 kms",Petrol
140,Toyota Corolla Altis 1.8 GL,Toyota,2010,289999,"70,000 kms",Petrol
769,Ford Fusion 1.4 TDCi Diesel,Ford,2007,125000,"85,455 kms",Diesel
844,Toyota Innova 2.5 Z Diesel 7 Seater,Toyota,2011,750000,"75,000 kms",Diesel
475,Honda City,Honda,2015,499999,"55,000 kms",Petrol
864,Tata Indica eV2 LS,Tata,2016,50500,"91,200 kms",Diesel
361,Mahindra XUV500,Mahindra,2015,1000000,"15,000 kms",Diesel
470,Maruti Suzuki Swift Dzire Tour VXi,Maruti,2011,230000,65 kms,Petrol
551,Maruti Suzuki Dzire ZXI,Maruti,2013,380000,"35,000 kms",Petrol
166,Chevrolet Beat LS Diesel,Chevrolet,2011,145000,"45,000 kms",Diesel
426,Maruti Suzuki Swift Dzire Tour LDi,Maruti,2015,220000,"1,29,000 kms",Diesel
141,Toyota Corolla Altis 1.8 J,Toyota,2012,349999,"59,000 kms",Petrol
678,Audi A4 2.0 TDI 177bhp Premium,Audi,2016,1900000,"44,000 kms",Diesel
685,Mahindra Scorpio 2.6 SLX,Mahindra,2004,175000,"58,000 kms",Diesel
232,Land Rover Freelander 2 SE,Land,2015,2100000,"30,000 kms",Diesel

In [316]:
df['kms_driven']=df['kms_driven'].str.split(' ').str.get(0).str.replace(',','')

In [317]:
df=df[df['kms_driven'].str.isnumeric()]

In [318]:
df['kms_driven'].sample(20)

550    10000
254    50000
188    38200
492    56000
529    75000
34     39000
527    51000
29     23452
172    47000
384    70000
756    28000
211    20000
530    55800
482    70000
182    31000
514    25000
370     3200
838     9000
739    46000
771    47000
Name: kms_driven, dtype: object

In [319]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 817 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        817 non-null    object
 1   company     817 non-null    object
 2   year        817 non-null    int32
 3   Price       817 non-null    int32
 4   kms_driven  817 non-null    object
 5   fuel_type   816 non-null    object
dtypes: int32(2), object(4)
memory usage: 38.3+ KB

In [320]:
df['kms_driven']=df['kms_driven'].astype('int32')

In [321]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 817 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        817 non-null    object
 1   company     817 non-null    object
 2   year        817 non-null    int32
 3   Price       817 non-null    int32
 4   kms_driven  817 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 35.1+ KB

In [322]:
df=df[~df['fuel_type'].isna()]

In [323]:
df

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,80000,45000,Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,425000,40,Diesel
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,325000,28000,Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,575000,36000,Diesel
6,Ford Figo,Ford,2012,175000,41000,Diesel
...,...,...,...,...,...,...
883,Maruti Suzuki Ritz VXI ABS,Maruti,2011,270000,50000,Petrol
885,Tata Indica V2 DLE BS III,Tata,2009,110000,30000,Diesel
886,Toyota Corolla Altis,Toyota,2009,300000,132000,Petrol
888,Tata Zest XM Diesel,Tata,2018,260000,27000,Diesel
889,Mahindra Quanto C8,Mahindra,2013,390000,40000,Diesel

In [324]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 816 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        816 non-null    object
 1   company     816 non-null    object
 2   year        816 non-null    int32
 3   Price       816 non-null    int32
 4   kms_driven  816 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 35.1+ KB